Resources/OpenFOAM_Case/injectorNozzle-OF11/0.orig/alphatB
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    object          alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0.015;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "injectorWall.*"
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
        value           $internalField;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
