Resources/OpenFOAM_Case/injectorNozzle-OF11/constant/physicalProperties.vapour
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.vapour;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    //thermo          hConst;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   17.0;
    }
    thermodynamics
    {
        Cp          3000;
        Cv          2800;
        Hf          1e6;
    }
    transport
    {
        mu          1.84e-05;
        Pr          2;//0.7;
    }
}

// ************************************************************************* //
