Resources/OpenFOAM_Case/injectorNozzle-OF11/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    backBM
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8065;
        startFace       16076;
    }
    frontBM
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8065;
        startFace       24141;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       32206;
    }
    outlet
    {
        type            patch;
        nFaces          55;
        startFace       32236;
    }
    symmetry
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          93;
        startFace       32291;
    }
    injectorWallFine
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          331;
        startFace       32384;
    }
    injectorWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          87;
        startFace       32715;
    }
)

// ************************************************************************* //
