Resources/OpenFOAM_Case/injectorNozzle-OF11/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compressibleInterFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.0005;

deltaT          5e-09;

writeControl    adjustableRunTime;

writeInterval   1e-06;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.25;

maxAlphaCo      0.25;

maxDeltaT       1;

functions
{
    #includeFunc    residuals
    #includeFunc    yPlus
    #includeFunc    wallHeatFlux
    #includeFunc    wallHeatTransferCoeff
}


// ************************************************************************* //
