Resources/OpenFOAM_Case/injectorNozzle-OF11/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(omega)   cellLimited Gauss linear 1;
}

divSchemes
{
    default         	none;
    div(phi,alpha)  	Gauss interfaceCompression vanLeer 1;
    div(rhoPhi,U)   	Gauss limitedLinear 1;
    div(alphaRhoPhi,e)  Gauss upwind;
    div(alphaRhoPhi,T)  Gauss upwind;
    div(rhoPhi,K)   	Gauss limitedLinear 1;
    div(rhoPhi,T)   	Gauss limitedLinear 1;
    div(rhoPhi,k)   	Gauss upwind;
    div(rhoPhi,omega) 	Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;
    div(phi,p)      	Gauss upwind;
    //div(((thermo:rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
