Resources/OpenFOAM_Case/injectorNozzle-OF11/system/wallHeatTransferCoeff
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the estimated incompressible flow heat transfer coefficient at
    wall patches, outputting the data as a volScalarField.

\*---------------------------------------------------------------------------*/

type            wallHeatTransferCoeff;
libs            ("libfieldFunctionObjects.so");

model           kappaEff;

rho             30;  // Density; e.g., 1.225 kg/m^3 for air
Cp              3000;   // Specific heat capacity at constant pressure;
                        // e.g., 1005 J/kg/K for air
Pr              2;   // Laminar Prandtl number; e.g, 0.7
Prt             0.9;  // Turbulent Prandtly number; e.g., 0.9

Lchar           1e-5;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
